ПД_sev/src/Tasks/ЗадачиПользователя/ЗадачиПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>ЗадачиПользователя</name>
  <basedOn>Catalog.Проекты</basedOn>
  <addressing>InformationRegister.РегистрАдресации</addressing>
  <attributes>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокНапоминания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <addressingAttributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

ПД_sev/src/Tasks/ЗадачиПользователя/Forms/ФормаЗадачи/Module.bsl
&НаКлиенте
Процедура ВзятьНаИсполнение(Команда)
	Объект.Исполнитель = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеПараметраСеанса("ТекущийПользователь");
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	Записать();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПередВыполнением(Отказ)
	Если Не ЗначениеЗаполнено(Объект.Комментарий) Тогда
		//Сообщить("Перед выполнение необходимо заполнить комментарий!", СтатусСообщения.Важное);
		ПоказатьОповещениеПользователя("Ошибка!",,"Перед выполнение необходимо заполнить комментарий!", БиблиотекаКартинок.Сервис);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		ЗаполнитьНовыйОбъектСервер();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНовыйОбъектСервер()
	Объект.Куратор = ПараметрыСеанса.ТекущийПользователь;
	Объект.Исполнитель = ПараметрыСеанса.ТекущийПользователь; 
КонецПроцедуры
